{"channelId":"794989572152098855","startingMessage":"Here you can change the settings of this bot. You can change the settings stated at the bottom. To change a setting, type in the chat the name of the setting\n\n -role request \n -command prefix \n -welcome \n\n In the menus you can type exit to stop the settings","roleRequest":{"message":"What do you want to see in the role request? \n\n -roles \n -message","rolesOption":{"message":"What do you want to see in roles? \n\n -show all \n -change (not implemented) \n -remove (not implemented) \n -add","add":{"askName":"What is the name of the role you want to add?","askEmoji":"What is the id of the emoji?\n\nTo get the id follow these steps:\n1: Copy the emoji\n2: Type in the chat a 'backslash' and paste the emoji\n3: Now you will see <name:id>","askRole":"What is the id of the role?\n\nTo get the id you first need to turn on developer mode: Open your Discord settings (the next to your name at the bottom left) and click on Appearance. There you will find Developer Mode. Click the toggle to enable it.\nTo get the ID of the role is, go to the server settings, click on roles, right click on the role, click on Copy ID","finished":"The role will now be added! This can take at most 1 minute."}},"messageOption":{"message":"What do you want to see in message? \n\n -change","change":{"message":"Type in what message you want it to say","finished":"The message for role request is changed!"}}},"commandPrefix":{"message":"What do you want to see in command prefix? \n WARNING, change this only if you know what your doing!\n\n -change","change":{"message":"Type in what the command prefix should be (default: !)","finished":"The command prefix has been changed"}},"welcome":{"message":"What do you want to see in welcome? \n\n -change","change":{"message":"Type in what the welcome message should be. You can use the following parameters: \n -`//name//` here will be the username of the user that joined \n -`//roleRequestChannel//` here will the role request channel come ","finished":"The welcome message has been changed"}}}